openfoam13/periodic_channel/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-5;

boundaryField
{
    inlet           { type cyclic; }
    outlet          { type cyclic; }
    //inlet           { type zeroGradient; }
    //outlet          { type zeroGradient; }
    //inlet
    //{
    //    type            mapped;
    //    patch           outlet;   // Look at the outlet
    //    setAverage      off;      // Copy the exact profile, don't average it
    //}
    //outlet
    //{
    //    type            zeroGradient; 
    //}
    bottom
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    frontAndBack    { type empty; }
}


// ************************************************************************* //
